# Taps
tap 'ivandokov/homebrew-contrib'
tap 'nicoverbruggen/homebrew-cask'
tap 'teamookla/speedtest'

# Tools
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh'
brew 'bash'
brew 'fzf'
brew 'zoxide'
brew 'eza'
brew 'fd'
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'svn' # Required to install some of the fonts
brew 'nano'
brew 'grep'
brew 'rsync'
brew 'httpie'
brew 'mackup'
brew 'zsh-autosuggestions'
brew 'blueutil'
brew 'gh'
brew 'act'
brew 'btop'
brew 'bat'
brew 'wget'
brew 'fnm'
cask 'rectangle'

# Development
brew 'ansible'
cask 'docker'
cask 'herd'

# Apps
cask 'google-drive'
cask 'iterm2'
cask 'imageoptim'
brew 'ivandokov/contrib/phockup'
brew 'speedtest-cli'
cask 'google-chrome'
cask 'slack'
cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'sequel-ace'
cask 'tinkerwell'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'scroll-reverser'
cask 'the-unarchiver'
cask 'viber'
cask 'balenaetcher'
cask 'figma'
cask 'discord'
cask 'monitorcontrol'
cask 'netspot'
cask 'plex'
cask 'garmin-basecamp'
cask 'anydesk'
cask 'orcaslicer'
cask 'darktable'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-oswald'
