# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'ivandokov/homebrew-contrib'

# Tools
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh'
brew 'bash'
brew 'git'
brew 'svn' # Required to install some of the fonts
brew 'nano'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'zsh-autosuggestions'
brew 'blueutil'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node@14'
brew 'redis'

# Apps
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'karabiner-elements'
cask 'imageoptim'
brew 'ivandokov/contrib/phockup'
cask 'alfred'
cask 'there'
cask 'docker'
cask 'google-drive-file-stream'
cask 'google-chrome'
cask 'slack'
cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'cyberduck'
cask 'sequel-ace'
cask 'tinkerwell'
cask 'transmission'
cask 'teamviewer'
cask 'vlc'
cask 'spotify'
cask 'scroll-reverser'
cask 'discord'
cask 'the-unarchiver'
cask 'viber'
cask 'zoom'
cask 'tunnelblick'
cask 'balenaetcher'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-oswald'
