# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'ivandokov/homebrew-contrib'
tap 'nicoverbruggen/homebrew-cask'
tap 'teamookla/speedtest'

# Tools
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh'
brew 'bash'
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'svn' # Required to install some of the fonts
brew 'nano'
brew 'grep'
brew 'rsync'
brew 'httpie'
brew 'mackup'
brew 'zsh-autosuggestions'
brew 'blueutil'
brew 'gh'
brew 'act'
brew 'btop'
brew 'bat'
brew 'wget'
brew 'fnm'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'ansible'
brew 'mailhog'
cask 'wkhtmltopdf'
cask 'phpmon'
cask 'docker'

# Apps
cask 'google-drive'
cask 'iterm2'
cask 'karabiner-elements'
cask 'alt-tab'
cask 'imageoptim'
brew 'ivandokov/contrib/phockup'
brew 'speedtest'
cask 'alfred'
cask 'google-chrome'
cask 'slack'
cask 'sublime-text'
cask 'jetbrains-toolbox'
cask 'sequel-ace'
cask 'tinkerwell'
cask 'nrlquaker-winbox'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'scroll-reverser'
cask 'the-unarchiver'
cask 'viber'
cask 'zoom'
cask 'balenaetcher'
cask 'figma'
cask 'discord'
cask 'messenger'
cask 'monitorcontrol'
cask 'netspot'
cask 'plex'
cask 'garmin-basecamp'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-oswald'
